/* SecItemAdd failed */
"Adding generic password to keychain failed." = "Adding generic password to keychain failed.";

/* SecItemAdd failed */
"Adding internet password to keychain failed." = "Adding internet password to keychain failed.";

/* Writing raw key data to the keychain produced an error. */
"Adding key data to keychain failed." = "Adding key data to keychain failed.";

/* SecItemAdd failed */
"Adding secret to keychain failed." = "Adding secret to keychain failed.";

/* Attempt to delete a keychain item failed. */
"Deleting generic password from keychain failed." = "Deleting generic password from keychain failed.";

/* Attempt to delete a keychain item failed. */
"Deleting internet password from keychain failed." = "Deleting internet password from keychain failed.";

/* Removing an item from the keychain produced an error. */
"Deleting keychain item failed." = "Deleting keychain item failed.";

/* Attempt to delete a keychain item failed. */
"Deleting secret from keychain failed." = "Deleting secret from keychain failed.";

/* Error description for cryptographic operation failure" */
"Keychain data is empty or not UTF-8 encoded." = "Keychain data is empty or not UTF-8 encoded.";

/* Attempt to read a keychain item failed. */
"Reading generic password from keychain failed." = "Reading generic password from keychain failed.";

/* Attempt to read a keychain item failed. */
"Reading generic secret from keychain failed." = "Reading generic secret from keychain failed.";

/* Attempt to read a keychain item failed. */
"Reading internet password from keychain failed." = "Reading internet password from keychain failed.";

/* Attempt to read a keychain item failed. */
"Reading key data from keychain failed." = "Reading key data from keychain failed.";

/* Attempt to read a keychain item failed. */
"Reading key from keychain failed." = "Reading key from keychain failed.";

/* Error description for serialization operation failure. */
"String decoding failed." = "String decoding failed.";

/* Error description for serialization operation failure. */
"String encoding failed." = "String encoding failed.";
